In [2]:
import pandas as pd

In [6]:
salary_1 = pd.read_csv('data/salary_1.csv')

In [8]:
salary_1.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0

In [13]:
salary_1.shape

(3999, 9)

In [7]:
salary_2 = pd.read_csv('data/salary_2.csv')

In [9]:
salary_2.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,29,Female,1,Human Resources Coordinator,2,45000,China,Chinese,0
1,23,Male,0,Sales Associate,1,25000,USA,Asian,0
2,32,Female,2,Software Developer,7,90000,USA,African American,0
3,44,Male,1,Operations Manager,18,170000,USA,Hispanic,0
4,26,Female,1,Marketing Coordinator,2,40000,Canada,Asian,0

In [14]:
salary_2.shape

(2685, 9)

In [10]:
salary_df = pd.concat([salary_1, salary_2], axis=0, ignore_index=True)

In [17]:
salary_df = salary_df.reset_index(drop=True)

In [18]:
salary_df.isna().mean()

Age                    0.000598
Gender                 0.000000
Education Level        0.000000
Job Title              0.000000
Years of Experience    0.000000
Salary                 0.000000
Country                0.000000
Race                   0.000000
Senior                 0.000000
dtype: float64

In [20]:
salary_df.dropna(inplace=True)

In [21]:
salary_df.shape

(6680, 9)

In [28]:
gender_salary = salary_df.groupby(['Gender'])[['Salary']].mean()

In [30]:
gender_salary.reset_index(inplace=True)
gender_salary

   Gender         Salary
0  Female  107888.555814
1    Male  121393.353134

In [34]:
salary_df = salary_df.merge(gender_salary, on='Gender', how='left')

In [37]:
salary_df = salary_df.rename(columns={'Salary_x': 'Salary', 'Salary_y': 'Gender_salary'})

In [40]:
pivot_table = pd.pivot_table(
    salary_df, 
    index='Country', 
    columns='Gender', 
    values='Years of Experience')

In [41]:
pivot_table

Gender       Female      Male
Country
Australia  7.397227  8.493065
Canada     7.212199  8.878214
China      7.985618  8.444519
UK         7.575658  8.781466
USA        7.036526  8.475643

In [43]:
import numpy as np
salary_df['Salary_log'] = np.log(salary_df['Salary'])

In [46]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6680 entries, 0 to 6679
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6680 non-null   float64
 1   Gender               6680 non-null   object
 2   Education Level      6680 non-null   int64
 3   Job Title            6680 non-null   object
 4   Years of Experience  6680 non-null   float64
 5   Salary               6680 non-null   int64
 6   Country              6680 non-null   object
 7   Race                 6680 non-null   object
 8   Senior               6680 non-null   int64
 9   Gender_salary        6680 non-null   float64
 10  Salary_log           6680 non-null   float64
dtypes: float64(4), int64(3), object(4)
memory usage: 626.2+ KB

In [47]:
df_no_object = salary_df.select_dtypes(exclude='object')

In [49]:
df_no_object.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6680 entries, 0 to 6679
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6680 non-null   float64
 1   Education Level      6680 non-null   int64
 2   Years of Experience  6680 non-null   float64
 3   Salary               6680 non-null   int64
 4   Senior               6680 non-null   int64
 5   Gender_salary        6680 non-null   float64
 6   Salary_log           6680 non-null   float64
dtypes: float64(4), int64(3)
memory usage: 417.5 KB

In [50]:
from sklearn.preprocessing import RobustScaler

In [51]:
rs = RobustScaler()

In [52]:
rs.fit(df_no_object)

RobustScaler()

In [53]:
rs_df = rs.transform(df_no_object)

In [55]:
rs_df = pd.DataFrame(rs_df, columns=df_no_object.columns)

In [56]:
from sklearn.preprocessing import MinMaxScaler

In [57]:
mm = MinMaxScaler()

In [58]:
mm_df = mm.fit_transform(df_no_object)

In [59]:
from sklearn.decomposition import PCA

In [60]:
pca =  PCA(n_components=2)

In [61]:
# pca로 salary_df를 학습 및 변환하여 pca_df로 저장
pca_df =  pca.fit_transform(df_no_object)

In [63]:
pca_df =  pd.DataFrame(pca_df, columns=['PC1', 'PC2'])
pca_df.head()

            PC1          PC2
0 -25204.560235 -6500.821440
1 -50423.373777  6590.817604
2  34787.319694 -5513.628939
3 -55422.695715  6508.551345
4  84780.552225 -4690.968463

In [64]:
(pca.explained_variance_ratio_).sum()

0.9999999855512036